WanchalermPora/DW-V4-FW/board/pin_mux.c
/* =============================================================================
 * pin_mux.c — DynaWatch V4 pin multiplexing configuration
 *
 * Auto-generated stub — replace with MCUXpresso Config Tools output.
 *
 * Pin assignments (to be filled by Config Tools):
 *   LPUART1_TX  : GPIO_AD_24  (ALT0)   — debug UART TX
 *   LPUART1_RX  : GPIO_AD_25  (ALT0)   — debug UART RX
 *   LPSPI1_SCK  : GPIO_AD_28  (ALT0)   — ADS131M08 SPI clock
 *   LPSPI1_PCS0 : GPIO_AD_29  (ALT0)   — ADS131M08 chip select
 *   LPSPI1_SOUT : GPIO_AD_30  (ALT0)   — ADS131M08 MOSI
 *   LPSPI1_SIN  : GPIO_AD_31  (ALT0)   — ADS131M08 MISO
 *   GPIO7_0     : GPIO_DISP_B1_02      — ADS131M08 /DRDY interrupt
 *   GPIO6_10    : GPIO_EMC_B2_10       — 1PPS input (PTP sync)
 *   GPIO9_3     : GPIO_AD_03           — Status LED
 * =============================================================================
 */

#include "pin_mux.h"
#include "fsl_iomuxc.h"

void BOARD_InitBootPins(void)
{
    /* ---------------------------------------------------------------------- *
     * TODO: Replace with MCUXpresso Config Tools generated implementation.   *
     * ---------------------------------------------------------------------- */
    (void)0;
}
